[LANG]
language=English (Great Britain)
[FONT]
font-name=Arial
welcome-text-size=62
home-text-size=22
home-section-size=24
analysis-text-size=20
analysis-section-size=22
left-panel-size=14
panel-list-size=16
panel-list-label-size=20
panel-list-header-size=16
panel-list-item-size=13
panel-button-size=12
combobox-size=16
list-combobox-size=16
checkbox-size=16
radio-size=15
elem-size=12
image-button-size=14
form-text-size=15
list-text-size=16
search-edit-size=16
message-text-size=16
setting-button-size=12
process-text-size=14
properites-title-font=18
properites-section-font=16
log-list-item-text-size=12
log-list-item-sql-size=14
[ERROR]
000000=
200001=SQL syntax error
200002=File does not exist
200003=File is corrupted
200004=Parameter error
200026=Table name already exists
200027=Table name does not exist
200028=Error importing CSV file, failed to generate SQL, please check the CSV file content and configuration
300001=No table column selected to create index
300002=SQL statement cannot be empty
300003=SQL analysis only supports SELECT queries
[STRING]
home=Home
database=Database
analysis=Analysis
view=View
setting=Settings
items=records
tables=Tables
views=Views
triggers=Triggers
columns=Columns
indexes=Indexes
table=Table
clear-all=Clear All
yes=Yes
no=No
welcome-text=Welcome to CuteSqlite
home-text1=CuteSqlite is a graphical user client (GUI) tool for Sqlite3.
home-text2=It allows you to design, create and browse databases, manage database objects,
home-text3=and insert data as well as design and run SQL queries to process stored data.
home-text4=You can also migrate databases and data from other database vendors to Sqlite database.
db-section-text=Sqlite Database
analysis-text1=CuteSqlite allows you to analyse and optimise the performance of SQL statements.
analysis-text2=And it allows you to analyse the storage capacity of each table in the database,
analysis-text3=as well as configure database parameters to optimise the database.
perf-analysis-section-text=Performance Analysis
error-text=System Error:
create-database=Create a new database (Ctrl+N)
open-database=Open a database (Ctrl+O)
refresh-database=Refresh database (F5)
delete-database=Remove selected database from list (Del)
override-user-db=Data in the deleted file cannot be recovered. Confirm to overwrite the database?
create-db-success-text=Database created successfully
open-db-exists-inlist=Database is already open, please do not repeat the operation
open-db-success-text=Database opened successfully
delete-user-db=Confirm to remove database "{dbName}" from the list?
delete-db-success-text=Database successfully removed from list
query-editor=Query Editor
history=History
history-tip=History (F8)
result-list=Results
result-info=Information
result-table-data=Table Data
table-properties=Table Properties
exec-select-sql=Execute selected query (F9)
exec-all-sql=Execute all queries (F10)
explain-select-sql=Explain selected SQL statement (F11)
explain-query-plan-sql=Explain query plan of selected SQL statement (F12)
query-page-help=Auto-complete function: [Tab]->next tab; [Ctrl+Space]->list matching tags; [Ctrl+Enter]->list all tags
no-select-userdb=No database selected
no-sql-statement=No SQL statement in query editor
no-sql-content=No SQL content in query editor
show-form-view=Show Form View
export-result-as=Export as... (Ctrl+Alt+E)
copy-result-data=Copy data to clipboard
clear-all=Clear All
ok=OK
cancel=Cancel
export-text-description=Select the format to export data
csv-settings=CSV Options
csv-field-settings=Columns
csv-line-settings=Rows
csv-charset-settings=Character Set
excel-settings=Excel Options
sql-settings=SQL Options
export-fields-settings=Select the columns to export
terminated-by=Delimiter
enclosed-by=Enclosed by
escaped-by=Escape character
field-terminated-by=Column delimiter
field-enclosed-by=Column enclosed by
field-escaped-by=Column escape character
line-terminated-by=Line delimiter
add-column-name=Add column names in header
csv-charset=Character Set
excel-column-max-size=Text column size limit
excel-decinmal-places=Decimal places
structure-only=Structure only
data-only=Data only
structure-and-data=Structure and data
select-all=Select All
deselect-all=Deselect All
save-to-file=Save to file
expert-fmt-error=Please select the file format for exporting data
terminated-by-error=Please enter the value for "Delimiter"
enclosed-by-error=Please enter the value for "Enclosed by"
escaped-by-error=Please enter the value for "Escape character"
line-terminated-by-error=The value of "Line delimiter" is incorrect
excel-column-max-size-error=Please enter the value for "Text column size limit"
excel-decinmal-places-error=Please enter the value for "Decimal places"
export-sql-error=Please select the SQL options
selected-fields-error=Please select the columns to export
export-path-error=Please enter the export file path
sql-notsupport-multitable-query-error=Exporting results of multi-table queries and subqueries is not supported
export-success-text=Export successful, {rows} rows of data exported. Open file?
open-the-file=Open file
export-file-exists-prompt={export-path} already exists. Replace it?
limit-rows=Limit rows
offset=Start row
rows=Number of rows
copy-all-rows-to-clipboard=Copy all rows to clipboard	Ctrl+Alt+A
copy-sel-rows-to-clipboard=Copy selected rows to clipboard	Ctrl+Alt+H
copy-all-rows-as-sql=Copy all rows as SQL	Ctrl+Alt+J
copy-sel-rows-as-sql=Copy selected rows as SQL	Ctrl+Alt+K
read-only=Read-Only
filter=Filter (Ctrl+Alt+F)
filter-in-use=Filter in use
refresh=Refresh (Ctrl+F5)
refresh-page=Refresh
new-row-tip=New row (Ctrl+Alt+N)
copy-row-tip=Copy row (Ctrl+Alt+C)
save-tip=Save (Ctrl+Alt+S)
delete-tip=Delete selected row (Ctrl+Del)
cancel-tip=Undo changes (Ctrl+Alt+Z)
revert-tip=Revert
save=Save
revert=Undo changes
column=Column name
condition=Condition
value=Value
delete-confirm-text=Confirm to delete selected rows?
query=Query
result=Result
affected-rows=Rows affected
exec-time=Execution time
transfer-time=Transfer time
total-time=Total time
database-create=Create DB		Ctrl+N
database-open=Open DB		Ctrl+O
database-refresh=Refresh DB		Ctrl+R
database-delete=Delete DB		Del
database-copy=Copy DB as...	Ctrl+P
database-export-as-sql=Export DB to SQL	Ctrl+E
database-import-from-sql=Import SQL to DB	Ctrl+I
database-new=Create
database-new-table=Table
database-new-view=View
database-new-trigger=Trigger
export-as-sql-text-description=Export selected database tables/views/triggers as SQL
select-database=Selected database
database-objects=Objects
structure-and-data-settings=Structure and data settings
insert-statement-settings=INSERT statement settings
tbl-statement-settings=Table statement settings
retain-column-text=Retain column names in "Insert Into"
contain-multi-rows-text=Each "Insert" statement contains multiple rows (VALUES)
retain-table-text=Retain old table (Create Table If Not Exists ...)
override-table-text=Override old table (DROP TABLE, then CREATE TABLE)
import-from-sql-text-description=Batch execute statements in SQL file.
abort-on-error-text=Stop on error.
import-file-not-exists=Imported SQL file does not exist, please select again.
import-path-empty-error=Import file path cannot be empty.
import=Import
export=Export
tbl-name=Table name
new-table=Create table
new-view=Create view
new-trigger=Create trigger
database=Database
schema=Schema
table-columns=Columns
table-indexes=Indexes
table-foreignkeys=Foreign Keys
column-name=Column name
data-type=Data type
default=Default
check=Check
index-name=Index name
index-type=Index type
index-unique=Unique
partial-clause=Partial clause
comments=Comments
to-be-selected=Available columns
selected=Selected
up=▲
down=▼
no-columns-selected=No columns selected, please select
sql-preview=SQL Preview
tbl-name-empty=Table name cannot be empty
tbl-name-duplicated=Table name already exists
create-table-success-text=Table created successfully.
alter-table-success-text=Table altered successfully.
rename-table-success-text=Table name changed successfully.
delete-column-confirm-text=The selected column is referenced by one or more indexes. Deleting this column will also modify the corresponding indexes. Confirm to continue deletion?
delete-index-confirm-text=The selected index is referenced by one or more columns. Deleting this index will also modify the corresponding columns. Confirm to continue deletion?
delete-confirm-text=Confirm to continue deletion?
new-view=Create view
new-trigger=Create trigger
create-a-view-name=New view name
view-name-not-empty=New view name cannot be empty
view-name-duplicated=View name already exists
create-a-trigger-name=Trigger name
trigger-name-not-empty=Trigger name cannot be empty
trigger-name-duplicated=Trigger name already exists
execute-sql-success=SQL executed successfully
copy-db-success-text=Database copied successfully
table-open=Open table data		Alt+O
table-create=Create table		Alt+N
table-alter=Alter table		Alt+A
table-rename=Rename table		Alt+M
table-truncate=Truncate table		Alt+T
table-drop=Drop table		Alt+Del
table-copy-as=Copy table to...		Alt+P
table-sharding-as=Sharding		Alt+G
table-export=Export table to...	Alt+E
table-import-sql=Import from SQL file	Alt+I
table-import-csv=Import from CSV file	Alt+J
table-manage-index=Manage table indexes
table-manage-foreign-key=Manage table foreign keys
properties=Properties
primary-key-duplicated=Primary key defined multiple times.
foreignkey-name=Foreign key name
referencing-columns=Columns in this table
referenced-table=Referenced table
referenced-columns=Referenced columns
on-update=On Update
on-delete=On Delete
insert-new-column=Add new column
insert-new-index=Add new index
insert-new-foreignkey=Add new foreign key
insert-del-column=Delete selected column
insert-del-index=Delete selected index
insert-del-foreignkey=Delete selected foreign key
select-referenced-table-first=Please select the referenced table first
new-table-name=New table name
table-name-not-empty=New table name cannot be empty
table-name-duplicated=New table name already exists
ai-column-exists=AUTOINCREMENT column already exists.
ai-fobidden-multi-pk=AUTOINCREMENT column already exists, multiple primary key columns are not allowed.
ai-column-must-integer=AUTOINCREMENT column must be of type INTEGER.
truncate-table-confirm-text=After truncating the table, data cannot be recovered. Confirm to truncate?
truncate-table-success-text=Table data truncated successfully
drop-table-confirm-text=After dropping the table, data cannot be recovered. Confirm to drop?
drop-table-success-text=Table dropped successfully
copy-table-text-description=Configure copy parameters, supports table sharding
from-db-name=Source database
from-tbl-name=Source table
to-db-name=Target database
to-tbl-name=Target table
table-sharding-setttings=Table sharding
enable-table-sharding=Enable table sharding
table-suffix-begin={suffix} Start integer
table-suffix-end={suffix} End integer
advanced-settings=Advanced sharding options
enable-copy-data-with-strategy=Enable strategy to copy data to sharded tables
sharding-strategy-express-text=Sharding strategy expression: {n}
preview-sql=Preview SQL statement
structure-and-data-settings-unknown=Structure and data settings not selected
table-suffix-error=Invalid sharding integer, please enter a correct value
target-table-name-no-n=Target table must contain the string "{n}".
sharding-strategy-express-empty=Sharding strategy expression cannot be empty
copy-table-success-text=Table copied successfully.
start=Start
complete=Complete
express-title=Table sharding strategy expression
functions=Functions
express-editor-help=Expression - double click a function or field to insert into editor
import-from-csv-text-description=Configuration for importing data from CSV file
source-csv-file=Source CSV file path
target-database=Target database
target-table=Target table
columns-setttings=Columns
csv-data=CSV data
column-name-on-top=First row as column names
line-terminated-by=Line delimiter
csv-null-as-keyword=null/NULL as SQL keyword
encoding=Character Set
import-success-text=Import successful
incorrect-sql-statement=Incorrect SQL statement
import-error-text=Import error
table-manage-columns=Manage columns
table-drop-column=Drop column
table-manage-indexes=Manage indexes
table-drop-index=Drop index
create-view=Create new view
open-view=Open view
drop-view=Drop view
create-trigger=Create trigger
open-trigger=Open trigger
drop-trigger=Drop trigger
drop-view-confirm-text=After dropping the view, it cannot be recovered. Confirm to drop?
drop-view-success-text=View dropped successfully
drop-trigger-confirm-text=After dropping the trigger, it cannot be recovered. Confirm to drop?
drop-trigger-success-text=Trigger dropped successfully
sql-templates=SQL statement templates
pragma-templates=Pragmas
sql-log=SQL history
clear-all=Clear All
use=Use
explain=Explain
top=Pin
untop=Unpin
copy=Copy
delete=Delete
today=Today
yestoday=Yesterday
delete-sql-log-confirm-text=Are you sure you want to delete the SQL log?
copy-to-clipboard=Copied to clipboard
save-success-text=Save successful
delete-success-text=Delete successful
data-has-changed=Data has changed. Are you sure you want to close the page?
not-save-and-close=Don't save, close
cancel=Cancel close
table-export-as=Export data table	Alt+E
export-as-sql-success-text=Export successful. Open file?
new-query=New query window (F7)
save-current=Save current (Ctrl+S)
save-all=Save all (Ctrl+Shift+S)
first-page=First page
prev-page=Previous page
next-page=Next page
last-page=Last page
save-if-data-has-changed=Data has changed. Save before closing?
unsort=Unsort
tab-close-this=Close this
tab-close-others=Close others
tab-close-left=Close all to the left
tab-close-right=Close all to the right
perf-analysis=Performance analysis
perf-analysis-reports=Analysis reports
store-analysis=Storage analysis
db-params=Database parameters
not-select-sql=Only SELECT statements are supported
open-sql-log=Open SQL log for performance analysis (Ctrl+L)
add-sql-analysis=Enter SQL statement for performance analysis (Ctrl+I)
sql-log-not-found=SQL log not found, please check if it has been deleted
original-sql=Original SQL statement
where-clause-analysis=WHERE clause analysis
order-clause-analysis=ORDER clause analysis
covering-index-analysis=Covering index analysis
table-join-analysis=Joins analysis
in-table=Data table
where-use-column=WHERE statement uses columns
order-use-column=ORDER statement uses columns
covering-index-column=WHERE and ORDER statements use columns
where-use-index=WHERE statement uses index
order-use-index=ORDER statement uses index
use-covering-index=Uses covering index
create-index-for-performance=Recommendation: create an index for the following columns to improve query performance
hint-index-for-performance=Hint: index {hintIndexName} already covers columns: {hintIndexColumns}
create-covering-index-for-performance=Recommendation: create a covering index for the following columns to improve query performance
create-index-togeger=Create index (together)
create-index-individ=Create indexes (individually)
create-covering-index=Create covering index
explain-query-plan=Explain Query Plan
query-optimizer-pseudocode=The pseudocode below shows the execution process of the query optimizer
cycle-count=Cycle statistics
optimize-cycle-count=Hint: changing the JOIN order of tables can optimise and reduce the number of cycles.
general-settings=General settings
about=About
language-setting=Interface language setting
change-language-restart-text=Changing the language requires restarting this software.
close-and-restart=Close and restart
do-not-restart=Do not restart
about-us=About us
about-us-description=CuteSqlite is open source software developed by author Xuehan Qin.
version-info=Version
version-info-description=CuteSqlite v0.2.2 beta (64-bit)
feedback=Feedback
feedback-description=If you have software issues, or have ideas and suggestions for this application, please fill out the form below to give us feedback.
content-text=Content
license=Apache License Version 2.0
select-columns-analysis=SELECT columns analysis
select-use-column=SELECT statement uses the following columns
select-use-column-count=Number of columns
select-use-column-advice=Recommendation: SELECT statement selects more than {maxColumns} columns. Reducing the number of columns can improve query performance.
select-use-column-tips=Hint: reducing the number of columns can improve query performance.
sql-perf-report-prefix=sql-performance-report-
store-analysis-prefix=Storage analysis:
analysis-sql=SQL analysis
open-perf-report=Open report		Alt+O
drop-perf-report=Delete report		Alt+Del
drop-perf-report-confirm-text=Confirm to delete the report?
store-analysis-text=Allows you to analyse the storage capacity of the database, data tables, table indexes
table-store-analysis=Table - {tblName}
index-store-analysis=Index - {idxName} - Table: {tblName}
db-disk-used-title=Disk space usage report, DB path: {dbPath}
page-size-text=Page size (bytes)
page-size-tips=Page size (bytes)
file-bytes-text=File size (bytes)
file-bytes-tips=File size (bytes)
file-pgcnt-text=Number of pages in the whole file (measured)
file-pgcnt-tips=Number of pages in the whole file (measured)
file-pgcnt2-text=Number of pages in the whole file (calculated)
file-pgcnt2-tips=Number of pages in the whole file (calculated)
inuse-pgcnt-text=Number of pages storing data (used)
inuse-pgcnt-tips=Number of pages storing data (used)
free-pgcnt2-text=Number of pages without data (per header)
free-pgcnt2-tips=Number of pages without data (per header)
free-pgcnt-text=Number of pages without data (calculated)
free-pgcnt-tips=Number of pages without data (calculated)
av-pgcnt-text=Number of auto-vacuumed pages
av-pgcnt-tips=Number of auto-vacuumed pages
ntable-text=Number of tables in the database
ntable-tips=Number of tables in the database
nindex-text=Number of indexes
nindex-tips=Number of indexes
nmanindex-text=Number of defined indexes
nmanindex-tips=Number of defined indexes
nautoindex-text=Number of implicit indexes (auto-increment indexes)
nautoindex-tips=Number of implicit indexes (auto-increment indexes)
user-payload-text=Bytes of user payload stored
user-payload-tips=Bytes of user payload stored
all-tbl-entrycnt-title=Total data of all tables (number of records)
all-tbl-idx-pagecnt-title=Number of pages of all tables and their indexes
sperate-tbl-idx-pagecnt-title=Pages of all tables and indexes calculated separately
all-tbl-idx-report-title=All tables and indexes
total-pages-percent-text=Percentage of total database pages
total-pages-percent-tips=Percentage of total database pages
nentry-text=Amount of data (number of records)
nentry-tips=Amount of data (number of records)
storage-text=Storage bytes used
storage-tips=Storage bytes used
compressed-size-text=Bytes used after compression
compressed-size-tips=Bytes used after compression
payload-text=Payload bytes
payload-tips=Payload bytes
total-meta-text=Metadata bytes
total-meta-tips=Metadata bytes
depth-text=B-tree depth
depth-tips=B-tree depth
avg-payload-text=Average payload per record
avg-payload-tips=Average payload per record
avg-unused-text=Average unused bytes per record
avg-unused-tips=Average unused bytes per record
avg-meta-text=Average metadata per record
avg-meta-tips=Average metadata per record
avg-fanout-text=Average fanout
avg-fanout-tips=Average fanout
gap-cnt-text=Non-contiguous pages
gap-cnt-tips=Non-contiguous pages
mx-payload-text=Maximum payload per record
mx-payload-tips=Maximum payload per record
ovfl-cnt-text=Number of overflow records used
ovfl-cnt-tips=Number of overflow records used
int-pages-text=Number of index pages used
int-pages-tips=Number of index pages used
leaf-pages-text=Number of leaf pages used
leaf-pages-tips=Number of leaf pages used
ovfl-pages-text=Number of overflow pages used
ovfl-pages-tips=Number of overflow pages used
total-pages-text=Total number of pages used
total-pages-tips=Total number of pages used
int-unused-text=Unused bytes on index pages
int-unused-tips=Unused bytes on index pages
leaf-unused-text=Unused bytes on leaf pages
leaf-unused-tips=Unused bytes on leaf pages
ovfl-unused-text=Unused bytes on overflow pages
ovfl-unused-tips=Unused bytes on overflow pages
total-unused-text=Unused bytes on all pages
total-unused-tips=Unused bytes on all pages
all-table-report-title=All tables (excluding indexes)
all-indices-report-title=All indexes (excluding tables)
tbl-and-all-idx-report-title=Table {tblName} and all its indexes
tbl-only-report-title=Table {tblName} (excluding any indexes)
idx-only-report-title=All indexes of table {tblName}
tbl-report-title=Table {tblName}
idx-report-title=Index {idxName} of table {tblName}
props-tbl-only-report-title=Storage analysis of table {tblName}
props-idx-props-only-report-title=All indexes of table {tblName}
db-pragma-params=PRAGMA parameters
db-quick-config-params=Quick configuration options
select-pragma=PRAGMA
pragma-analysis-limit-tips=Query or change the limit for analysis (ANALYZE) settings. This is the approximate number of rows the ANALYZE command examines in each index.
pragma-application-id-tips=Used to query or set the 32-bit signed big-endian "Application ID" integer located at offset 68 in the database header.
pragma-auto-vacuum-tips=Query or set the auto-vacuum status in the database.
pragma-automatic-index-tips=Query, set, or clear the automatic indexing feature.
pragma-busy-timeout-tips=Query or change the busy timeout setting.
pragma-cache-size-tips=Query or change the maximum number of database disk pages that SQLite recommends to keep in memory for each open database file.
pragma-cache-spill-tips=Enable or disable the paging program's ability to spill dirty cache pages to the database file in the middle of a transaction.
pragma-case-sensitive-like-tips=The default behaviour of the LIKE operator ignores case for ASCII characters. Thus, by default, 'a' LIKE 'A' is true.
pragma-cell-size-check-tips=Enable or disable additional sanity checks when reading database B-tree pages from disk. When cell size check is enabled, database corruption can be detected earlier and is less likely to "spread".
pragma-checkpoint-fullfsync-tips=Query or change the fullfsync flag for checkpoint operations. If this flag is set, the F_FULLFSYNC synchronisation method will be used during checkpoint operations on systems that support F_FULLFSYNC. The default value of the CHECKPOINT_FULLFSYNC flag is OFF. Only Mac OS-X supports F_FULLFSYNC.
pragma-collation-list-tips=Returns a list of collation sequences defined for the current database connection.
pragma-compile-options-tips=Returns the names of compile-time options used when building SQLite, one option per row.
pragma-count-changes-tips=Query or change the count changes flag. Normally, when the count-changes flag is not set, INSERT, UPDATE and DELETE statements do not return data.
pragma-data-store-directory-tips=Query or change the value of the sqlite3_data_directory global variable, used by the Windows operating system interface backend to determine the location of database files specified with a relative path.
pragma-data-version-tips=Indicates that the database file has been modified. Interactive programs that keep database contents in memory or display them on screen can use the PRAGMA data_version command to determine whether they need to refresh and reload memory or update the screen display.
pragma-default-cache-size-tips=Query or set the recommended maximum number of disk cache pages that will be allocated for each open database file.
pragma-defer-foreign-keys-tips=Instructs that all foreign key constraints be deferred until the outermost transaction is committed.
pragma-empty-result-callbacks-tips=Query or change the empty result callback flag.
pragma-encoding-tips=The text encoding used by the main database: 'UTF-8', 'UTF-16le' (little-endian UTF-16), or 'UTF-16be' (big-endian UTF-16).
pragma-foreign-key-check-tips=Checks the database or table for foreign key constraint violations.
pragma-foreign-keys-tips=Query, set, or clear the enforcement of foreign key constraints.
pragma-freelist-count-tips=Returns the number of unused pages in the database file.
pragma-full-column-names-tips=Query or change the full_column_names flag.
pragma-fullfsync-tips=Query or change the fullfsync flag. This flag determines whether the F_FULLFSYNC synchronisation method will be used on systems that support it. The default value of fullfsync is OFF. Only Mac OS X supports F_FULLFSYNC.
pragma-hard-heap-limit-tips=Imposes a limit on the amount of heap memory for all database connections in a single process.
pragma-ignore-check-constraints-tips=Enable or disable the enforcement of CHECK constraints. The default setting is OFF, meaning CHECK constraints are enforced by default.
pragma-incremental-vacuum-tips=Causes up to N pages to be removed from the freelist.
pragma-integrity-check-tips=Performs a low-level formatting and consistency check on the database.
pragma-journal-mode-tips=Query or set the journal mode for the database associated with the current database connection.
pragma-journal-size-limit-tips=Limits the size of rollback journals and WAL files left in the filesystem after a transaction or checkpoint.
pragma-legacy-alter-table-tips=Set or query the value of the legacy_alter_table flag.
pragma-locking-mode-tips=Set or query the database connection locking mode. The modes are NORMAL or EXCLUSIVE.
pragma-max-page-count-tips=Query or set the maximum number of pages in the database file.
pragma-mmap-size-tips=Query or change the maximum number of bytes reserved for memory-mapped I/O on a single database.
pragma-module-list-tips=Returns a list of virtual table modules registered with the database connection.
pragma-optimize-tips=Attempts to optimise the database.
pragma-page-count-tips=Returns the total number of pages in the database file.
pragma-page-size-tips=Query or set the page size of the database. The page size must be a power of two between 512 and 65536.
pragma-parser-trace-tips=Turns on tracing of the SQL parser used internally by SQLite. Only effective when compiled with SQLITE_DEBUG.
pragma-query-only-tips=Prevents data changes on the database file. When enabled, any attempt to CREATE, UPDATE, DROP, INSERT or UPDATE will result in an SQLITE_READONLY error.
pragma-quick-check-tips=Performs a low-level formatting and consistency check on the database, skipping UNIQUE and index consistency checks.
pragma-read-uncommitted-tips=Query, set, or clear the READ UNCOMMITTED isolation.
pragma-recursive-triggers-tips=Query, set, or clear the recursive trigger capability.
pragma-reverse-unordered-selects-tips=When enabled, this PRAGMA causes many SELECT statements without an ORDER BY clause to return results in an order that is usually reversed.
pragma-schema-version-tips=Gets or sets the schema_version integer at offset 40 in the database header.
pragma-secure-delete-tips=Query or change the secure-delete setting.
pragma-short-column-names-tips=Query or change the short column names flag.
pragma-soft-heap-limit-tips=Limits the amount of heap memory used by all database connections in a single process.
pragma-stats-tips=Returns auxiliary information about tables and indexes.
pragma-synchronous-tips=Query or change the setting of the "synchronous" flag.
pragma-temp-store-tips=Query or change the value of the sqlite3_temp_directory global variable, used by many operating system interface backends to determine where to store temporary tables and indexes.
pragma-threads-tips=The number of helper threads started by a prepared statement to assist with the query.
pragma-trusted-schema-tips=Whether to allow running unsafe SQL functions and virtual tables in the schema. Determines whether views, triggers, or schema expressions (such as CHECK constraints, DEFAULT clauses, generated columns, expression indexes and/or partial indexes) are allowed to run unsafe SQL functions and virtual tables.
pragma-user-version-tips=Gets or sets the user_version integer at offset 60 in the database header.
pragma-vdbe-addoptrace-tips=Complete VDBE opcodes are displayed during code generation. Provided SQLite is compiled with the SQLITE_DEBUG option and vdbe_debug is enabled.
pragma-vdbe-debug-tips=Turns on VDBE debugging. Provided SQLite is compiled with the SQLITE_DEBUG option.
pragma-vdbe-listing-tips=Displays a complete listing of the virtual machine opcodes on standard output. Provided SQLite is compiled with the SQLITE_DEBUG option and vdbe_debug is enabled.
pragma-vdbe-trace-tips=Prints virtual machine opcodes on standard output during computation. Provided SQLite is compiled with the SQLITE_DEBUG option and vdbe_debug is enabled.
pragma-wal-autocheckpoint-tips=Query or set the write-ahead log auto-checkpoint interval.
pragma-wal-checkpoint-tips=Causes the contents of the write-ahead log for database X on database connection D to be transferred to the database file and resets the write-ahead log.
pragma-writable-schema-tips=Allows the sqlite_schema table to be changed using ordinary UPDATE, INSERT and DELETE statements. Warning: misuse of this pragma can easily result in database file corruption.
pragma-save-confirm=PRAGMA statements will affect database operation. Confirm to execute the following statement?
confirm-exec-text=Confirm & Execute